JaZafier00716/school/APPS/apps-mcxn-workspace.mcu/test/source/main-test.cpp
// **************************************************************************
//
//               Demo program for APPS labs
//
// Subject:      Computer Architectures and Parallel systems
// Author:       Petr Olivka, petr.olivka@vsb.cz, 02/2025
// Organization: Department of Computer Science, FEECS,
//               VSB-Technical University of Ostrava, CZ
//
// File:         Main program for testing.
//
// **************************************************************************

/**
 * @file    MCXN947_APPS.cpp
 * @brief   Application entry point.
 */
#include <stdio.h>
#include <functional>
#include "board.h"
#include "peripherals.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "fsl_debug_console.h"

#include "fsl_gpio.h"
#include "fsl_port.h"
#include "fsl_mrt.h"

#include "mcxn-kit.h"

// **************************************************************************
//! System initialization. Do not modify it!!!
void _mcu_initialization() __attribute__(( constructor( 0x100 ) ));

void _mcu_initialization()
{
    BOARD_InitBootPins();
    BOARD_InitBootClocks();
    BOARD_InitBootPeripherals();
    CLOCK_EnableClock( kCLOCK_Gpio0 );
    CLOCK_EnableClock( kCLOCK_Gpio1 );
    CLOCK_EnableClock( kCLOCK_Gpio2 );
    CLOCK_EnableClock( kCLOCK_Gpio3 );
    CLOCK_EnableClock( kCLOCK_Gpio4 );
}
// **************************************************************************

//! Global data

//! LEDs on MCXN-KIT - instances of class DigitalOut
DigitalOut g_led_P3_16( P3_16 );
DigitalOut g_led_P3_17( P3_17 );
//
//! Button on MCXN-KIT - instance of class DigitalIn
DigitalIn g_but_P3_18( P3_18 );
DigitalIn g_but_P3_19( P3_19 );
DigitalIn g_but_P3_20( P3_20 );
DigitalIn g_but_P3_21( P3_21 );

#define T 20

class LED
{
public:
    DigitalOut m_led;
    uint32_t m_T0;        // cas T0

  LED( pin_name_t t_led_pin ) : m_led( t_led_pin )
    {
	  m_T0 = 0;
    }

    void nastav_jas_proc( uint8_t t_jas_proc )
    {
        m_T0 = T * ((double)t_jas_proc/100);
    }
};

//class BTN
//{
//public:
//	DigitalIn m_btn;
//	bool clicked;
//
//	BTN(uint32_t t_btn_pin) : m_led(t_btn_pin)
//	{
//		clicked = false;
//	}
//};

LED g_red_led[] = { P3_16, P3_17 };

//LED p16(P3_16);
//LED p17(P3_17);

void pwm_control()
{
  static unsigned int tick = 0;

  if(tick < g_red_led[0].m_T0) {
	  g_red_led[0].m_led.write(1);
  } else {
	  g_red_led[0].m_led.write(0);
  }

  if(tick < g_red_led[1].m_T0) {
	  g_red_led[1].m_led.write(1);
  } else {
	  g_red_led[1].m_led.write(0);
  }

  tick++;

  if(tick >= T) {
	  tick = 0;
  }
}

int main()
{

  Ticker pwm1;
  pwm1.attach( pwm_control, 1 );
  g_red_led[0].nastav_jas_proc( 5 );
  g_red_led[1].nastav_jas_proc( 50 );

    while ( 1 ) __WFI();
}
